app/controllers/organics_controller.rb

SELECT "organics".* FROM "organics"
---
  def index
    @organics = Organic.all

UPDATE "organics" SET "title" = ?, "description" = ?, "price" = ?, "updated_at" = ? WHERE "organics"."id" = ?  [["title", "page"], ["description", "nancy"], ["price", 50], ["updated_at", "2017-12-26 09:48:53.777899"], ["id", 12]]
---
  def update
   if @organic.update(organic_params)

DELETE FROM "organics" WHERE "organics"."id" = ?  [["id", 4]]
---
  def destroy
    @organic.destroy

INSERT INTO "organics" ("title", "description", "price", "created_at", "updated_at", "image", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "9d"], ["description", "ddd"], ["price", 50], ["created_at", "2018-01-16 16:34:10.367119"], ["updated_at", "2018-01-16 16:34:10.367119"], ["image", "客戶頁面.png"], ["user_id", 7]]
---
   def create
    @organic = current_user.organics.new(organic_params)

     if @organic.save

SELECT  "organics".* FROM "organics" WHERE "organics"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def find_by
     @organic = Organic.find_by(id: params[:id])